Repository: advancedresearch/lojban
Catalog: assets/en-jbo.tmx
Source language: en
Languages: jbo

source: You don't attend, you pay attention, under the typical logic.
jbo: do zvati naje jundi teni'i zu'i

source: One times one is one, according to mathematics.
jbo: li pa pi'i pa du li pa te ni'i lo cmaci

source: I leave motivated by computer gaming and sleeping with my beloved.
jbo: .i mi cliva mu'i le nu samru'e kelci gi'e sipna do'e le mi se prami

source: Why do you ask?
jbo: .i do reisku mu'i ma

source: I like talking to you, regardless of the short amount of time.
jbo: mi gleki lo ka tavla do kei mu'i nai le cmalu temci

source: I'm very hungry, which motivates that I am about to eat.
jbo: .i mi mutce xagji se mu'i le nu mi pu'o citka

source: I'm leaving, but you don't have to cry.
jbo: mi cliva se mu'i nai lo nu do klaku

source: You leave because of me.
jbo: temu'i mi do klama

source: I go to the store to motivate my mom.
jbo: mi klama le zarci te mu'i le mi mamta

source: I like lojban because I think in a figuratively lojbanic manner.
jbo: .i mi nelci la lojban ki'u lenu mi pensi ta'i le pe'a lojbo

source: Why do you say goodbye?
jbo: .i ki'u ma do cusku zo co'o

source: I'm familiar with "study" and not without the reason I often study.
jbo: mi selsau zo slabu na ki'u nai lo za'i mi so'i roi cilre

source: West is in trouble not because he is a gay man, but because he is a man who was apparently willing to use the power of his public office to solicit sexual favors.
jbo: la uest cu se nabmi ge ki'u nai lo nu .u bu mitcinpa'i nanmu gi ki'u lo nu .u bu simlu lo ka djica lo nu pilno lo nu catni fi lo gubni jibri kei lo nu cpedu lo cinse nu selfu

source: I am at a work meeting, which is the reason for my slow replies.
jbo: .i mi ca gunka penmi seki'u le nu masno spusku

source: Regardless of that reason, I defend the noble Lojban language against word-shape crimes.
jbo: .i se ki'u nai bo mi jai bandu le nobli ke lojbo bangu lo vlatai zekri

source: Apparently, the computer compels me to not see the interesting discussion.
jbo: .i za'a bai lo skami mi nalviska le se cinri nu casnu

source: I hit the ball forcing it to roll down from the top of the hill.
jbo: mi darxi le bolci se bai lo nu ri gunro farlu fi le gapru traji mokca be le cmalu cmana

source: The guy starts being on top of the girl and experiences his penis being soft.
jbo: le nakni cu co'a cpana le fetsi fau lo nu le nakpinji cu ranti

source: Reply me via mail only when you read and understand this.
jbo: i ko spusku mrilu mi po'o fau lonu do tcidu je jimpe ti

source: While standing up, I say that the eating is over.
jbo: .i fau lo nu mi sanli binxo kei mi cusku le se du'u mo'u citka

source: You enter, with the key word being a requirement.
jbo: .i do nenri sau tu'a le ckiku valsi

source: Please stand at the stairs. This is a prerequisit for me to defend you.
jbo: .i .e'o do sanli vi le serti se sau le nu mi fi do badgau

source: I go to the office as required by my work.
jbo: mi klama le briju te sau lo nu mi gunka

source: The experience of a looping discussion in all languages which results in nothing is the cause.
jbo: .i le li'i clupa nu casnu bau roda ja'e node cu rinka

source: Regardless of this, I am not able to sleep.
jbo: .i ja'e nai bo mi na ka'e sipna

source: I become a pear because I eat pears.
jbo: mi binxo lo perli se ja'e lo nu mi citka lo perli

source: I walk because I don't have a car.
jbo: mi cadzu se ja'e lo nu mi na ralte lo karce

source: I walk, but not because I don't own a car.
jbo: mi cadzu se ja'e nai lo nu mi na ralte lo karce

source: I walk regardless of whether or not I own a car.
jbo: mi cadzu se ja'e nai lo nu mi na ralte lo karce

source: Under the conditions of y'all not being able to fight in lojban, please don't fight.
jbo: .i .e'o do na damba va'o lo nu rodo na kakne lo nu damba bau la .lojban.

source: What should a person feel to buy something?
jbo: .ei dai lo prenu ma cinmo se va'o lo nu ri te vecnu

source: Data is capable of wanting to be free, as Roger Clarke knows.
jbo: du'o la rodjer.klark lo datni cu kakne lo nu djica lo nu zifre

source: We go to the market, knowing that Tom is there.
jbo: ma'a klama lo zarci soi se djuno lo du'u la tom cu zvati zy

source: I'll be right back. Wow, I'm reading, knowing something about Loglan.
jbo: .i di'a jundi .i .u'e mi tcidu soi te djuno la .loglan.

source: I, knowing something about medicine, can help.
jbo: mi noi te djuno lo mikce saske cu ka'e sidju

source: Under the epistemology of your dream, you clearly see me.
jbo: ve du'o le do selsne do mi klina viska

source: Jesus is God in Christianity.
jbo: la .iesos. cu cevni ve du'o lo xriso

source: I left with Dad's permission.
jbo: mi cliva zau la patfu

source: I was just at the company meating, where the new business plan was approved.
jbo: mi pu zi vitke lo kagni nunpenmi be se zau lo cnino kagni platu

source: As said by Dag, I wrote, "It was the most delicious." on the guest-book of the restaurant yesterday.
jbo: i cu'u la dag mi ciska lu traji lo ka kukte li'u lo vitke vreji cukta pe lo gusta ca lo prulamdei

source: As said by the Lojban Group and the law, Lojban is equal to Loglan.
jbo: cu'u le jbogri .e le flalu la lojban cu ba'e du la loglan

source: I like "The Appassionata", played by Arthur Rubinstein.
jbo: mi nelci la .apasionatas. pe cu'u la .artr. rubnstain.

source: I know internally that it is a children's song that express that life is only a dream.
jbo: se'o verba selsanga se cu'u le se du'u lo za'i jmive cu selsenva po'o

source: I am amused by the idea of commanding by saying "Be a snail!".
jbo: mi se zdile le si'o minde soi se cusku lu ko cakcurnu li'u

source: I don't like when parents yell at infants.
jbo: mi nelci nai lo nu lo rirni cu krixa te cu'u lo cifnu

source: I read the poem for my family.
jbo: mi tcidu lo pemci te cu'u le lanzu be mi

source: I am going to explain it completely on the wiki.
jbo: .ai mi ba mulno ciksi ve cu'u la uikis

source: Bancus and I had a conversation on IRC.
jbo: mi joi la bancus cu casnu ve cu'u la .irk.

source: Hey Robin, you aren't obliged. However, it's amusing, based on your opinion.
jbo: doi .robin. do na bilga .i ku'i zdile ji'u lo se jinvi be do

source: I believe in perfection, based on Plato.
jbo: mi krici lo prane ji'u la .platon.

source: I enjoy the wisdom of Socrates, which was the basis for Plato.
jbo: mi nelci lo se prije be la .sokrates. bei se ji'u la .platon.

source: As an authority on such things, how can you describe the typical Lojban-enthusiast?
jbo: lo'e jbonei cu mo ca'i do

source: I went to the military camp with Kordobas's authorization.
jbo: mi pu klama le bilni ginka ca'i la .kordobas.

source: Being a soldier is my job, where I have authority over bombs.
jbo: lo nu sonci cu jibri mi se ca'i lo jbama

source: My leaving is permitted, based on the command of the king.
jbo: lo nu mi cliva cu curmi te ca'i lo te minde be fi lo nolraitru

source: How do you make the smoke?
jbo: ta'i ma do zbasu lo danmo

source: By what method did you learn Lojban?
jbo: ta'i ma do cilre la lojban

source: Do you study by discussing?
jbo: pei do tadni ta'i lo nu casnu

source: In other words, many nodes continuously stream music files as a method of preventing me from copying them.
jbo: va'i so'i tcana cu ru'i benji lo zgike vreji se ta'i lo nu mi na kakne lo nu fukpi gasnu

source: I run a lot as a method for the Olympics.
jbo: mi mutce bajra se ta'i tu'a la .olimpiks.

source: I wash myself, this being sensible in the case that I am dirty.
jbo: mi lumci lo nei te ta'i lo nu mi to'e jinsa

source: I will run under the condition that it's not raining.
jbo: mi ba bajra te ta'i lo nu na carvi

source: How do you destroy a building?
jbo: do gasnu co spofu lo dinju ta'i ma

source: By what process do you suggest I do something?
jbo: do stidi lonu mi co'e kei pu'e ma

source: I invent stories by writing down whatever I think of.
jbo: mi finti lo lisri soi pruce lo nu ciska ro da poi mi pensi

source: Suppose I remove, starting with hair one inch in length, leaving hair a half inch in length. Is that shaving?
jbo: i da'i vimcu se pu'e lo kerfa noi gutci be li pa be'o ku'o ku fo lo kerfa noi gutci be li fi'u re .i lo nu go'i cu nu krevi'u xu

source: I make bottles starting with glass rods.
jbo: mi zbasu lo botpi se pu'e lo blaci grana

source: I got some glass rods and processed them into bottles.
jbo: mi cpacu lo blaci grana te pu'e lo botpi

source: I make bottles by the stages of getting glass rods and melting the rods.
jbo: mi zbasu lo botpi soi ve pruce lo nu cpacu lo blaci grana vau ce'o lo nu rumgau lo grana

source: There is a high chance of precipitation.
jbo: la'asai carvi

source: I still love Mary.
jbo: mi ca'o prami la maris

source: He is not afraid of anything.
jbo: ra terpa no da

source: They gave us a lot to eat.
jbo: za'u ra pu dunda fi mi'a fe so'i lo cidja

source: The women gave us a lot to eat.
jbo: za'u le ninmu pu dunda fi mi'a fe so'i lo cidja

source: Do you own this?
jbo: pei do ponse ti

source: Can we come too?
jbo: pei mi'ai ji'a tolcliva

source: I don't like when mothers yell at children.
jbo: mi na nelci lo nu lo mamta cu krixa soi te cusku lo panzi

source: I read the poem for my child.
jbo: mi tcidu lo pemci te cu'u le panzi be mi

source: Why am I still alive?
jbo: seja'e ma mi ca'o jmive

source: You and I had a conversation in Facebook.
jbo: mi joi do pu casnu ve cu'u la faisybuk

source: I talk to you about mathematics.
jbo: mi cusku fi do fe lo srana be lo cmaci

source: She is late.
jbo: ra jai lerci

source: The boy is speaking to his grandfather.
jbo: le nanla caca'o tavla lo be ri rirpa'u

source: We all need air and water to live.
jbo: ro ma'a nitcu lo vacri e lo djacu lo ka jmive

source: You can't agree with everyone about everything.
jbo: sei na cumki do tugni ro da ro de

source: I know you know I know. But does she know that you know I know?
jbo: mi djuno lo nu do djuno lo nu mi djino i ku'i pei ra djuno lo nu do djuno lo nu mi djuno

source: I'm no longer hungry.
jbo: mi ba'o xagji

source: It's snowing on the streets.
jbo: ca snime carvi bu'u lo klaji

source: Tom has big feet.
jbo: la tom cu se jamfu lo barda

source: Tom stayed home.
jbo: la tom pu stali bu'u lo zdani

source: Nobody needs me.
jbo: no da nitcu mi

source: Thrice the brinded cat hath mew'd. Thrice and once the hedge-pig whined. Harpier cries "'Tis time, 'tis time".
jbo: i ciroiku lo grusi mlatu pu cusku zo mi'au i cisu'iparoiku lo citno ernace pu cmoni i lo xarpi cu krixa lu ca ku i caku li'u

source: Now you tell.
jbo: nauku do cusku

source: I'm happy when you do that.
jbo: mi gleki ca lo nu do zukte ra

source: Drinking warm milk will help you get to sleep.
jbo: lo nu do pinxe lo milxe glare ladru cu zabna rinka lo nu do sipna

source: I don't want to.
jbo: mi djica nai

source: The fact that I said farewell to someone in the past doesn't necessarily mean I won't greet them in the future.
jbo: lo nu mi pu tolrinsa da na naka'enai rinka lo nu mi na ba rinsa da

source: No way.
jbo: tai no da

source: I don't know him.
jbo: mi se slabu nai ra

source: Shall we play?
jbo: pei mi'ai kelci

source: There are things I have to know about.
jbo: fe da mi djuno e'i

source: You're not afraid of me.
jbo: ko na terpa mi

source: I will probably be given a car by my dad and I would feel happy about it if that happened.
jbo: la'a ui dai'i mi ba te dunda lo karce lo mi patfu

source: I don't understand the problem.
jbo: mi jimpe nai lo du'u makau nabmi

source: We have many things to be thankful for.
jbo: so'i da te ckire ei ma'a

source: God save Ukraine!
jbo: doi cevni ko stogau lo vukrygugde

source: Amazingly heads turned to the female wolves as they began to howl. It was a sign of younger wolves.
jbo: co'i lo ka lafti lo stedu vau lo fetsi labno pu co'a cmoni i sefabo sinxa fi loi verba labno

source: Are we agreed?
jbo: pei mi'o simxu tolpro

source: Leave, you deer!
jbo: ko cliva doi mirli .ionai

source: How was the wind yesterday?
jbo: lo brife pu ckaji ma ca lo prulamdei

source: The proletarians have nothing to lose but their chains.
jbo: lo proletari cu ei cirko lo po'o linsi pe lo nei

source: This is the view from the balcony.
jbo: ti jvinu fi lo balni

source: Tom didn't want to get married.
jbo: la .tom. na djica lo nu spebi'o

source: Tom knows how to swim like a fish.
jbo: la tom cu djuno lo tadji be lo nu limna tai lo finpe

source: How do you like my new hat?
jbo: lo pe mi cnino mapku pei

source: That is the perfect wave.
jbo: tu prane boxna

source: Thanks for the good advice.
jbo: xamgu se stidi ki'e

source: I think this is too expensive.
jbo: pe'i dukse kargu

source: What beer are you drinking?
jbo: ma klesi lo birje poi do caca'o pinxe

source: Where is a Japanese restaurant?
jbo: lo gusta be le ponjo cu zvati ma

source: Where is a kosher restaurant?
jbo: lo gusta be le cidjrkacera cu zvati ma

source: Where is a halal restaurant?
jbo: lo gusta be le cidjrxalalu cu zvati ma

source: Where is an American restaurant?
jbo: lo gusta be le merko cu zvati ma

source: Where is a vegetarian restaurant?
jbo: lo gusta be le recycau cu zvati ma

source: He who doesn't know foreign languages, doesn't know his own.
jbo: lo na se bangu lo fange cu na se bangu lo nei

source: When is the next bus to Boston?
jbo: ca ma cliva fa lo bavla'i basfa poi klama la boston

source: When is the last bus to Boston?
jbo: ca ma cliva fa lo romoi basfa poi klama la boston

source: There is nothing new under the moon.
jbo: cnino fa no cnita be la lunra

source: Tom opened the door and looked inside.
jbo: la tom pu kargau lo vorme vaujebabo catlu lo nenri

source: I'm not a child. Don't talk to me like I am.
jbo: mi verba nai i ko tavla nai mi tai lo nu go'i

source: You're not a girl.
jbo: do na ninmu

source: I like your room.
jbo: mi nelci lo kumfa po do

source: He doesn't sleep anymore.
jbo: ra ba'o sipna

source: The tree is high.
jbo: le tricu cu sraji clani

source: I'm interested in learning Lojban.
jbo: mi ca se cinri lo nu cilre tu'a lo jbobau

source: I'm meeting a friend of mine at the store.
jbo: mi ba penmi lo pendo be mi lo zaisle

source: Dogs are animals. It doesn't therefore follow that animals are dogs.
jbo: lo gerku cu danlu .iseni'inai bo lo danlu cu gerku

source: Listen to your father.
jbo: ko tinju'i lo be do patfu

source: Tom walked into the room.
jbo: la tom pu mo'u cadzu klama lo nenri be lo kumfa

source: You never understand anything.
jbo: do noroi jimpe da

source: I claim this apple is delicious.
jbo: mi xusra lo du'u se kukte lo ti plise ku kei ku
